Торговля_11__демо/src/InformationRegisters/НастройкиИнтеграцииСПлатежнымиСистемамиУТ/НастройкиИнтеграцииСПлатежнымиСистемамиУТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИнтеграцииСПлатежнымиСистемамиУТ</name>
  <resources>
    <name>Интеграция</name>
    <type>
      <types>CatalogRef.НастройкиИнтеграцииСПлатежнымиСистемами</types>
    </type>
  </resources>
  <resources>
    <name>ПлатежнаяСистема</name>
    <type>
      <types>EnumRef.ТипыПлатежнойСистемыККТ</types>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыЭквайринга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Торговля_11__демо/src/Enums/ТипыПлатежнойСистемыККТ/ТипыПлатежнойСистемыККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПлатежнойСистемыККТ</name>
  <enumValues>
    <name>СистемаБыстрыхПлатежей</name>
  </enumValues>
  <enumValues>
    <name>SWiP</name>
  </enumValues>
  <enumValues>
    <name>СертификатНСПК</name>
  </enumValues>
  <enumValues>
    <name>ЮКасса</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
</mdclass:Enum>

Торговля_11__демо/src/Enums/СпособыПроведенияПлатежей/СпособыПроведенияПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПроведенияПлатежей</name>
  <enumValues>
    <name>ИнтернетЭквайринг</name>
  </enumValues>
  <enumValues>
    <name>ЭквайринговыйТерминал</name>
  </enumValues>
  <enumValues>
    <name>СистемаБыстрыхПлатежей</name>
  </enumValues>
</mdclass:Enum>

Торговля_11__демо/src/Enums/ТипыСтатусовОплатыСБП/ТипыСтатусовОплатыСБП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСтатусовОплатыСБП</name>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

Торговля_11__демо/src/Documents/РеализацияПодарочныхСертификатов/РеализацияПодарочныхСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияПодарочныхСертификатов</name>
  <registerRecords>InformationRegister.АктивацияПодарочныхСертификатов</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <registerRecords>InformationRegister.ИсторияПодарочныхСертификатов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныеСредстваКонтрагент</registerRecords>
  <registerRecords>AccumulationRegister.ПодарочныеСертификаты</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваВПути</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваВКассахККМ</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоЭквайрингу</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоНаличными</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЧековККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодарочныеСертификаты</name>
    <attributes>
      <name>ПодарочныйСертификат</name>
      <type>
        <types>CatalogRef.ПодарочныеСертификаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРасчетов</name>
      <type>
        <types>CatalogRef.ОбъектыРасчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаПлатежнымиКартами</name>
    <attributes>
      <name>ЭквайринговыйТерминал</name>
      <type>
        <types>CatalogRef.ЭквайринговыеТерминалы</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>22</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>КодАвторизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылочныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЧекаЭТ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.ТипыПлатежнойСистемыККТ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПлатежнойСистемы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорПодключения</name>
      <type>
        <types>CatalogRef.ДоговорыЭквайринга</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОплатыСБП</name>
      <type>
        <types>EnumRef.ТипыСтатусовОплатыСБП</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Торговля_11__демо/src/CommonModules/ИнтеграцияСПлатежнымиСистемамиПереопределяемый/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ИнтеграцияСПлатежнымиСистемами".
// ОбщийМодуль.ИнтеграцияСПлатежнымиСистемамиПереопределяемый.
//
// Переопределяемые серверные процедуры интеграции с Системой быстрых платежей:
//  - работа с настройками оплат в прикладной конфигурации;
//  - определение параметров оплаты и возврата на основании первичного документа;
//  - обработка статусов выполнения оплат и возвратов.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область НастройкиИнтеграции

// Определяет прикладные настройки интеграции с Системой быстрых платежей.
//
// Параметры:
//  Настройки - Структура - настройки интеграции:
//    *ОбъектМетаданных - Метаданные.РегистрыСведений - объект метаданных регистр сведений,
//      в котором хранятся настройки выполнения оплат. Регистр определяет связь торговой точки
//      Системы быстрых платежей и аналитики ведения учета в программах 1С. На основании данных
//      регистра должен выполняется поиск торговой точки (настройки интеграции) при выполнении
//      оплат и возвратов;
//    *ИсключаемыеПоля - Массив Из Строка - наименования измерений, ресурсов или реквизитов, которые
//      необходимо скрыть на форме настройки интеграции. 
//
Процедура ПриОпределенииНастроекИнтеграции(Настройки) Экспорт
	
	//++ Локализация
	ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ;
	Настройки.Вставить("ОбъектМетаданных", ОбъектМетаданных);
	
	ИсключаемыеПоля  = Новый Массив;
	ИсключаемыеПоля.Добавить("ПлатежнаяСистема");
	
	Настройки.Вставить("ИсключаемыеПоля",  ИсключаемыеПоля);
	//-- Локализация
	
КонецПроцедуры

// Определяет алгоритм записи настроек оплат в регистр сведений указанный в методе
// ИнтеграцияСПлатежнымиСистемамиПереопределяемый.ПриОпределенииНастроекИнтеграции.
//
// Параметры:
//  ПараметрыОплаты - Структура - содержит данные для записи настроек в регистр сведений.
//    Структура параметра соответствует структуре регистра, которая определена
//    в метаданных за исключением полей указанных в настройках в свойстве ИсключаемыеПоля
//    процедуры ИнтеграцияСПлатежнымиСистемамиПереопределяемый.ПриОпределенииНастроекИнтеграции;
//  Отказ - Булево - следует устанавливать значение Истина, если в процессе записи возникли ошибки;
//  СообщениеОбОшибке - Строка - сообщение для пользователя. Отображается в случае, если в параметр
//    Отказ установлено значение Истина.
//
Процедура ПриЗаписиНастроекИнтеграции(ПараметрыОплаты, Отказ, СообщениеОбОшибке) Экспорт
	
	//++ Локализация
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		ПустаяНастройка = Новый Структура("Идентификатор", "");
		
		Договор    = ПараметрыОплаты.Получить("Договор");
		Интеграция = ПараметрыОплаты.Получить("Интеграция");
		
		НастройкиИнтеграции = ?(ЗначениеЗаполнено(Интеграция), 
			ИнтеграцияСПлатежнымиСистемами.НастройкиТорговойТочки(Интеграция), 
			ПустаяНастройка);
		
		ПлатежнаяСистемаККТ = Перечисления.ТипыПлатежнойСистемыККТ.СистемаБыстрыхПлатежей;
		
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ");
		ЭлементБлокировки.УстановитьЗначение("Договор", Договор);
		
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Если ЗначениеЗаполнено(Интеграция) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор КАК Договор
			|ИЗ
			|	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ КАК НастройкиИнтеграцииСПлатежнымиСистемамиУТ
			|ГДЕ
			|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция = &Интеграция";
			Запрос.УстановитьПараметр("Интеграция", Интеграция);
			
			ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Набор = РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ.СоздатьНаборЗаписей();
				Набор.Отбор.Договор.Установить(ВыборкаДетальныеЗаписи.Договор);
				Набор.Записать();
			КонецЦикла;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ КАК НастройкиИнтеграцииСПлатежнымиСистемамиУТ
		|ГДЕ
		|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор = &Договор
		|	И НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция <> &Интеграция
		|	И НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция.Используется";
		Запрос.УстановитьПараметр("Договор",    Договор);
		Запрос.УстановитьПараметр("Интеграция", Интеграция);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			СообщениеОбОшибке = НСтр("ru = 'Для организации и торгового объекта уже задана торговая точка.'");
			ВызватьИсключение СообщениеОбОшибке;
		КонецЕсли;
		
		Запись = РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ.СоздатьМенеджерЗаписи();
		Запись.Интеграция       = Интеграция;
		Запись.Договор          = Договор;
		Запись.ПлатежнаяСистема = ПлатежнаяСистемаККТ;
		Запись.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ИнтеграцияСПлатежнымиСистемамиПереопределяемый.ПриЗаписиНастроекИнтеграции'"
				, ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		Отказ = Истина;
		СообщениеОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	ОбновитьПовторноИспользуемыеЗначения();
	//-- Локализация
	
КонецПроцедуры

// Позволяет настроить элементы настройки приема оплат на формах подключения
// к Системе быстрых платежей.
//
// Параметры:
//  НастройкиФормы - Структура - содержит элементы формы и текущие значения реквизитов:
//    * ОбщиеЭлементы - Структура - общие настройки формы подключения к Системой быстрых платежей:
//      ** Наименование - Элемент - элемент формы, в котором заполняется наименование;
//    * ЭлементыНастроекОплаты - Структура - элементы формы настройки оплаты. Структура параметра
//        соответствует структуре регистра, который определяется в методе
//        ИнтеграцияСПлатежнымиСистемамиПереопределяемый.ПриОпределенииНастроекИнтеграции, за исключением
//        полей указанных в настройках в свойстве ИсключаемыеПоля.
//    * ЗначенияНастроекОплаты - Структура - текущее значение реквизитов настроек. Структура параметра
//        соответствует структуре регистра, который определяется в методе
//        ИнтеграцияСПлатежнымиСистемамиПереопределяемый.ПриОпределенииНастроекИнтеграции, за исключением
//        полей указанных в настройках в свойстве ИсключаемыеПоля:
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные параметры настройки интеграции с
//    Системой быстрых платежей, которые передаются в методе ИнтеграцияСПлатежнымиСистемамиКлиент.ПодключитьИнтеграциюССБП.
//
Процедура ПриНастройкеЭлементовФормыИнтеграции(НастройкиФормы, ДополнительныеПараметры) Экспорт
	
	//++ Локализация
	
	ЭлементФормы = НастройкиФормы.ЭлементыНастроекОплаты.Договор;
	
	СвязиПараметровВыбора = Новый Массив;
	ПараметрыВыбора       = Новый Массив;
	
	Связь = Новый СвязьПараметраВыбора("Отбор.Ссылка", "Договор");
	СвязиПараметровВыбора.Добавить(Связь);
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.СпособПроведенияПлатежа", Перечисления.СпособыПроведенияПлатежей.СистемаБыстрыхПлатежей);
	ПараметрыВыбора.Добавить(НовыйПараметр);

	ЭлементФормы.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	ЭлементФормы.ПараметрыВыбора       = Новый ФиксированныйМассив(ПараметрыВыбора);

	//-- Локализация
	
КонецПроцедуры

// Позволяет предзаполнить настройки приема платежей на формах подключения
// к Системе быстрых платежей.
//
// Параметры:
//  Настройки - Структура - содержит элементы формы и текущие значения реквизитов:
//    * ОбщиеНастройки - Структура - общие настройки формы подключения к Системой быстрых платежей:
//      ** Наименование - Строка - значение заполнения поля наименование;
//    * НастройкиОплаты - Структура - значение заполнения реквизитов настройки приема оплат. Структура параметра
//        соответствует структуре регистра, который определяется в методе
//        ИнтеграцияСПлатежнымиСистемамиПереопределяемый.ПриОпределенииНастроекИнтеграции, за исключением
//        полей указанных в настройках в свойстве ИсключаемыеПоля:
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные параметры настройки интеграции с
//    Системой быстрых платежей, которые передаются в методе ИнтеграцияСПлатежнымиСистемамиКлиент.ПодключитьИнтеграциюССБП.
//
Процедура ПриЗаполненииФормыИнтеграции(Настройки, ДополнительныеПараметры) Экспорт
	
	//++ Локализация
	Если ДополнительныеПараметры <> Неопределено Тогда
		Автонаименование = СтрШаблон(НСтр("ru = '%1'"), ДополнительныеПараметры);
		ЗаполнитьЗначенияСвойств(Настройки.ОбщиеНастройки,  Новый Структура("Наименование", Автонаименование));
		ЗаполнитьЗначенияСвойств(Настройки.НастройкиОплаты,  Новый Структура("Договор", ДополнительныеПараметры));
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ПрикладныеОперации

// Определяются данные для формирования запроса на оплату в платежную систему СБП.
// Все поля переменной ЗаказНаОплату обязательны для заполнения.
//
// Параметры:
//  ДокументОплаты - ОпределяемыйТип.ДокументОперацииБИП - документ, который отражает
//    продажу в информационной базе;
//  ЗаказНаОплату - Структура - содержит описание заказа на оплату в платежной системе СБП:
//    * СуммаОплаты - Число - сумма оплаты в платежной системе. Сумма, которую необходимо
//      списать со счета или карты покупателя;
//    * ДатаОплаты - Дата - дата операции оплаты;
//    * СрокЖизниQRКода - Число - содержит значение срока действия QR-кода в целых минутах.
//      Минимальное значение - 5 минут, максимальное значение - 129 600 минут
//      (90 дней в минутах). В случае передачи значения не входящего в выше
//      описанный диапазон возвращать ошибку "НеверныйФорматЗапроса".
//      Если значение не предано используется стандартный срок использования СБП;
//    * ОтложенноеПолучениеСтатуса - Булево - признак загрузки статуса оплаты регламентным заданием;
//    * НазначениеПлатежа - Строка - информация о платеже, которая будет отображена пользователю
//      в момент сканирования QR-кода в мобильном приложении. Рекомендуется
//      делать строку не длинной и включать информацию об организации, которая
//      является получателем денежных средств, например: Оплата СБП 524,00 RUB ООО Ромашка
//      Если строка не заполнена, будет передано стандартное представление
//      назначения: Оплата СБП {ЗаказНаОплату.СуммаОплаты} RUB.
//      Длина строки не должна превышать 140 символов, в противном случае будет
//      обрезана принудительно. Система быстрых платежей имеет дополнительные требования
//      к символам и их кодировке. Возможна передача следующих значений:
//        - символы латинского алфавит (A-Z и a-z) с десятичными кодами из диапазона
//        [065-090] и [091-122] в кодировке UTF-8;
//        - символы русского алфавит (А-Я и а-я) с десятичными кодами из диапазона
//          [065-090] и [091-122] в кодировке UTF-8;
//        - цифры (0-9) с десятичными кодами из диапазона [048-057] в кодировке UTF-8;
//        - специальные символы с десятичными кодами из диапазонов [032-047], [058-064],
//          [091-096],[123-126] в кодировке UTF-8;
//        - символ № под номером 8470 в кодировке UTF-8;
//  ТорговаяТочка - СправочникСсылка.НастройкиИнтеграцииСПлатежнымиСистемами -
//    настройка интеграции с платежной системой;
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные настройки формирования
//    заказа на оплату переданные при вызове функции ИнтеграцияСПлатежнымиСистемами.ИдентификаторОплаты.
//
Процедура ПриФормированииЗаказаНаОплатуСБП(
		ДокументОплаты,
		ЗаказНаОплату,
		ТорговаяТочка,
		ДополнительныеПараметры) Экспорт
	
	//++ Локализация
	Если ДополнительныеПараметры <> Неопределено Тогда
		
		ЗаказНаОплату.ДатаОплаты  = ДополнительныеПараметры.ДатаОплаты;
		ЗаказНаОплату.СуммаОплаты = ДополнительныеПараметры.СуммаОплаты;
		
	Иначе
		
		РеквизитыЗапроса   = Новый Структура("СуммаОплаты, ДатаОплаты", "СуммаДокумента", "Дата");
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОплаты, РеквизитыЗапроса);
		
		ЗаполнитьЗначенияСвойств(ЗаказНаОплату, РеквизитыДокумента);
		
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

// Определяются данные для формирования запроса на возврат в платежную систему СБП.
// Все поля переменной ЗаказНаВозврат обязательны для заполнения.
//
// Параметры:
//  ДокументВозврата - ОпределяемыйТип.ДокументОперацииБИП - документ, который отражает
//                     возврат в информационной базе;
//  ЗаказНаВозврат - Структура - содержит описание заказа на возврат в платежной системе СБП:
//    * СуммаВозврата - Число - сумма возврата в платежной системе. Сумма, которую необходимо
//      списать со счета или карты покупателя;
//    *ДатаВозврата - Дата - дата операции возврата;
//  ТорговаяТочка - СправочникСсылка.НастройкиИнтеграцииСПлатежнымиСистемами -
//    настройка интеграции с платежной системой;
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные настройки формирования
//    заказа на оплату переданные при вызове функции ИнтеграцияСПлатежнымиСистемами.ВозвратОплаты.
//
Процедура ПриФормированииЗаказаНаВозвратСБП(
		ДокументВозврата,
		ЗаказНаВозврат,
		ТорговаяТочка,
		ДополнительныеПараметры) Экспорт
	
	//++ Локализация
	Если ДополнительныеПараметры <> Неопределено Тогда
		
		ЗаказНаВозврат.ДатаВозврата  = ДополнительныеПараметры.ДатаВозврата;
		ЗаказНаВозврат.СуммаВозврата = ДополнительныеПараметры.СуммаВозврата;
		
		Если ОбщегоНазначения.СсылкаСуществует(ДокументВозврата) Тогда
			ЗаказНаВозврат.ДатаВозврата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументВозврата, "Дата");
		КонецЕсли;
		
	Иначе
		
		РеквизитыЗапроса   = Новый Структура("СуммаВозврата, ДатаВозврата", "СуммаДокумента", "Дата");
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументВозврата, РеквизитыЗапроса);
		
		ЗаполнитьЗначенияСвойств(ЗаказНаВозврат, РеквизитыДокумента);
		
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

// Определяет алгоритм обработки операции, статус которых был получен регламентным заданием.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииБИП - документ, который отражает
//    операцию в информационной базе;
//  РезультатОбработки - Структура - результат загрузки статуса операции:
//    * СтатусОперации - Строка - текущее состояние операции операции. Для проверки статуса
//      операции, необходимо функции программного интерфейса общего модуля
//      ИнтеграцияСПлатежнымиСистемамиКлиентСервер. Возможные значения:
//        - "Отменена" - по ранее сформированная операция отменена НСПК;
//        - "Выполнена" - участник СБП подтвердил выполнение операции;
//        - "Ошибка" - не удалось выполнить проверку статуса операции из-за ошибки
//           или участник СБП вернул ошибку;
//    * ПараметрыОперации - Структура - дополнительные данные по оплате:
//        * ДатаОперации - Дата - фактическая дата оплаты в UTC;
//        * СуммаОперации - Число - фактическая суммы операции по документу;
//        * ИдентификаторОперации - Строка - ключ контроля загрузки;
//    * СообщениеОбОшибке - Строка - сообщение пользователю. Заполняется в случае ошибки.
//  Обработан - Булево - признак обработки операции. Необходимо установить Истина,
//    после завершения обработки.
//
Процедура ПриЗагрузкеСтатусаОперации(
		ДокументОперации,
		РезультатОбработки,
		Обработан) Экспорт
	
	//++ Локализация
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить();
		Если ТипЗнч(ДокументОперации) = Тип("ДокументСсылка.ЧекККМ") Тогда
			ЭлементБлокировки.Область = "Документ.ЧекККМ";
		Иначе
			ЭлементБлокировки.Область = "Документ.РеализацияПодарочныхСертификатов";
		КонецЕсли;
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументОперации);
		Блокировка.Заблокировать();
		
		ДокументОперацииОбъект = ДокументОперации.ПолучитьОбъект();
		
		СтатусОплаты = Перечисления.ТипыСтатусовОплатыСБП.Ошибка;
		Если РезультатОбработки.СтатусОперации = ИнтеграцияСПлатежнымиСистемамиКлиентСервер.СтатусОперацииВыполнена() Тогда
			СтатусОплаты = Перечисления.ТипыСтатусовОплатыСБП.Выполнена;
		ИначеЕсли РезультатОбработки.СтатусОперации = ИнтеграцияСПлатежнымиСистемамиКлиентСервер.СтатусОперацииОтменена() Тогда
			СтатусОплаты = Перечисления.ТипыСтатусовОплатыСБП.Отменена;
		КонецЕсли;
		
		// В отложенном чеке может быть только оплата СБП 
		Для Каждого СтрокаОплатыПлатежнойКартой Из ДокументОперацииОбъект.ОплатаПлатежнымиКартами Цикл
			
			СтрокаОплатыПлатежнойКартой.СтатусОплатыСБП = СтатусОплаты;
			Если СтатусОплаты = Перечисления.ТипыСтатусовОплатыСБП.Выполнена Тогда
				СтрокаОплатыПлатежнойКартой.Сумма = РезультатОбработки.ПараметрыОперации.СуммаОперации;
			ИначеЕсли СтатусОплаты = Перечисления.ТипыСтатусовОплатыСБП.Ошибка Тогда
				СтрокаОплатыПлатежнойКартой.ТекстОшибки = РезультатОбработки.СообщениеОбОшибке;
			КонецЕсли;
			
		КонецЦикла;
		
		// Если срок жизни QR-кода оплаты сгорел, очищаем оплату СБП для возможности повторной оплаты
		Если СтатусОплаты = Перечисления.ТипыСтатусовОплатыСБП.Отменена Тогда
			ДокументОперацииОбъект.ОплатаПлатежнымиКартами.Очистить();
		КонецЕсли;
		
		ДокументОперацииОбъект.Записать();
		Обработан = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru='ИнтеграцияСПлатежнымиСистемамиПереопределяемый.ПриЗагрузкеСтатусаОперации'",
					ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.ИнтеграцияСПлатежнымиСистемамиПереопределяемый,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ФормаПодготовкиПлатежнойСсылки

// Определяет объекты, которые могут выступать в качестве оснований платежа через СБП.
//
// Параметры:
//  ИменаДокументовОперации - Массив Из Строка - имена объектов метаданных оснований платежа через СБП.
//
Процедура ПриОпределенииОбъектовСКомандамиСБП(ИменаДокументовОперации) Экспорт
	
	
КонецПроцедуры

// Определяет возможность формирования платежной ссылки на основании данных документа операции.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииБИП - документ, который отражает
//    операцию в информационной базе.
//  Результат - Структура - результат создания заказа на оплату в платежной системе:
//    * ИнтеграцияДоступна - Булево - признак доступности интеграции с платежной системой по данным документа операции.
//    * СообщениеОбОшибке - Строка - сообщение для пользователя. Отображается в случае, если в параметр
//    ИнтеграцияДоступна установлено значение Ложь.
//
Процедура ПриОпределенииДоступностиИнтеграцииПоДокументуОперации(ДокументОперации, Результат) Экспорт
	
	
КонецПроцедуры

// Определяет перечень возможных настроек интеграции на основании данных документа операции.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииБИП - документ, который отражает
//    операцию в информационной базе.
//  ПереченьТорговыхТочек - Массив Из СправочникСсылка.НастройкиИнтеграцииСПлатежнымиСистемами -
//    настройка интеграции с платежной системой.
//  НастройкиПодключения - Структура - дополнительные настройки подключения СБП
//   * БИК - Строка, Неопределено - идентификатор банка. Используется для автоматического
//     выбора участника СБП.
//   * ДополнительныеПараметры - Структура, Неопределено - дополнительные параметры подключения.
//     Значение будет передано в переопределяемые методы:
//       - ИнтеграцияСПлатежнымиСистемамиПереопределяемый.ПриЗаполненииФормыИнтеграции;
//       - ИнтеграцияСПлатежнымиСистемамиПереопределяемый.ПриНастройкеЭлементовФормыИнтеграции.
//   * ОтборУчастников - Строка, Неопределено - Параметры отбора участников СБП.
//     Допустимые значения - "Банки", "ПлатежныеАгрегаторы", "КассовыеСсылки", Неопределено.
//     Неопределено по умолчанию.
//  ТекстВопроса - Строка, Неопределено - текст вопроса, который будет выведен пользователю
//    перед началом формирования платежной ссылки или началом подключения к СБП.
//    Вопрос не выводится, если параметр имеет значение Неопределено.
//
Процедура ПриОпределенииПараметровИнтеграцииДокументаОперации(
		ДокументОперации,
		ПереченьТорговыхТочек,
		НастройкиПодключения,
		ТекстВопроса) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ФормаОтображенияQRКода

// Определяет алгоритм, выполняющийся при создании формы отображения QR-кода на форме подготовки платежной ссылки СБП.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма отображения QR-кода.
//  НастройкиФормы - Структура - описание настроек формы для размещения
//    программно созданных объектов.
//    * Группа - ГруппаФормы - элемент формы для программного добавления новых элементов управления,
//        в качестве свойства "Действие" у программно создаваемых команд,
//        необходимо указать значение "ПриОбработкеНажатияКоманды".
//
Процедура ПриСозданииНаСервереФормыQRКода(Форма, НастройкиФормы) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ФормаПодключениеКассовойСсылки

// Определяет алгоритм, выполняющийся при создании формы подключения кассовой ссылки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма подключения кассовой ссылки.
//  Отказ - Булево - признак отказа от открытия формы.
//
Процедура ПриСозданииНаСервереФормыПодключенияСсылки(Форма, Отказ) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ОтправкаСообщений

// Заполняет список получателей сообщения с платежной ссылкой.
//
// Параметры:
//  ДокументОперации - Произвольный - документ операции, для которого получена платежная ссылка.
//  ВариантОтправки - Строка - способ отправки ссылки. "ЭлектроннаяПочта" - по электронной почте, "Телефон" - по SMS.
//  Получатели - СписокЗначений - адреса электронной почты или номера телефонов получателей (строка).
//
//@skip-warning
Процедура ПриФормированииСпискаПолучателейСообщенияСБП(Знач ДокументОперации, Знач ВариантОтправки, Получатели) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ШаблоныСообщений

// Определяет параметры отправки сообщений с использованием шаблонов СБП.
//
// Параметры:
//  ПараметрыОтправкиСообщений - Структура - описание параметров отправки сообщений:
//    * ПараметрыОтправкиПисем - Структура - описание параметров отправки электронных писем:
//       ** ОтправлятьПисьмаВФорматеHTML - Булево, Неопределено - признак отправки электронных писем в формате HTML.
//          Если свойство не задано, в дальнейшем при наличии подсистемы "Взаимодействия" будет получено значение
//          функциональной опции "ОтправлятьПисьмаВФорматеHTML", либо Ложь при ее отсутствии.
//
Процедура ПриОпределенииПараметровОтправкиСообщенийCБП(ПараметрыОтправкиСообщений) Экспорт
	
	
	
КонецПроцедуры

// Возвращает признак использования шаблонов сообщений для интеграции с СБП.
//
// Параметры:
//  Используется - Булево - признак использования шаблонов сообщений.
//
//@skip-warning
Процедура ПриПроверкеИспользованияШаблоновСообщенийСБП(Используется) Экспорт
	
	
КонецПроцедуры

// Описывает предопределенные шаблоны писем по типу,
// с помощью которых можно будет выставлять счета для оплаты через СБП.
// Эти шаблоны будут доступны для создания из основной формы настроек и использоваться
// в форме формирования платежной ссылки СБП.
// Добавлены реквизиты:
//   * ПредставлениеСсылкиСБПQRКод - вставляет платежную ссылку в виде картинки (Base64).
//   * ПредставлениеСсылкиСБП - вставляет платежную ссылку в виде строки.
//
// Параметры:
//  Шаблоны - Массив - Массив структур данных, описывающих предопределенные шаблоны сообщения.
//    * ПолноеИмяТипаНазначения - Строка - Полное имя объекта метаданных, на основании которого по данному шаблону
//        будут создаваться письма.
//    * Текст - Строка - Текст, который будет использоваться в качестве шаблона письма в формате HTML.
//    * Тема - Строка - Текст, который будет использоваться в качестве шаблона темы письма.
//    * Наименование - Строка - Текст, наименование шаблона письма.
//    * Тип - Строка - Тип шаблона. Возможные значения:"Почта" или "SMS".
//
//@skip-warning
Процедура ПриОпределенииПредопределенныхШаблоновСообщенийСБППоТипам(Шаблоны) Экспорт 
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
